cases/openfoam.com/arbitraryWaterPump/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:                                        |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    location        "system";
    object          controlDict;
}

application     interFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         30;

deltaT          1e-05;

writeControl    adjustableRunTime;

writeInterval   0.025;

purgeWrite      0;

writeFormat     binary;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.9;

maxAlphaCo      0.9;

maxDeltaT       0.005;

functions
{
    diagnosticResidual
    {
        type            solverInfo;
        libs            ( utilityFunctionObjects );
        fields          ( p_rgh k epsilon alpha.water );
    }

    CoField
    {
        type            CourantNo;
        libs            ( fieldFunctionObjects );
        writeControl    writeTime;
    }

    pressureJumpBaffles
    {
        type            multiFieldValue;
        libs            ( fieldFunctionObjects );

        operation       subtract;

        functions
        {
            masterSide
            {
                type        surfaceFieldValue;
                operation   areaAverage;
                fields      ( p_rgh );
                regionType  patch;
                name        baffle_master; 
                log         true;
                writeFields no;
            }

            slaveSide
            {
                type        surfaceFieldValue;
                operation   areaAverage;
                fields      ( p_rgh );
                regionType  patch;
                name        baffle_slave; 
                log         true;
                writeFields no;
            }
        }
    }
}


// ************************************************************************* //
